# A Simple Review of pandas join and merge

This Jupyter notebook  attempts to explain pandas join and merge, explaining the different join types - inner, left, right, outer.

The data used taken from a simple table found in w3 school here.  The data were deliberatedly saved in a single Excel Workbook with each sheet belong to the Customers and Orders table.  The pd.read_excel show how easy it is to read individual Excel worksheets

In [1]:
import numpy as np
import pandas as pd

### Load data

In [3]:
customers = pd.read_excel("data.xlsx", sheet_name="customers")
orders = pd.read_excel("data.xlsx", sheet_name="orders")

### View data

In [5]:
customers

   CustomerID                        CustomerName     ContactName  Country
0           1                 Alfreds Futterkiste    Maria Anders  Germany
1           2  Ana Trujillo Emparedados y helados    Ana Trujillo   Mexico
2           3             Antonio Moreno Taquería  Antonio Moreno   Mexico

In [6]:
orders

   OrderID  CustomerID  OrderDate
0    10308           2 1996-09-18
1    10309          37 1996-09-19
2    10310          77 1996-09-20

### Joining Customers and Orders using Merge

### Using pd.Merge()

#### Inner Join

returns only rows that are available in both tables for which vlaues in columes on which the join is made (i.e. on='CustomerID') are the same. Returns only rows that match from both tables

In [57]:
customers.merge(orders, how='inner', on='CustomerID')

,CustomerID,CustomerName,ContactName,Country,OrderID,OrderDate
0,2,Ana Trujillo Emparedados y helados,Ana Trujillo,Mexico,10308,1996-09-18

#### left join (left outer join)

returns all the rows in the left table (i.e. customers) provide their matching values in the right table (i.e. orders)

In [58]:
customers.merge(orders, how='left', on='CustomerID')

,CustomerID,CustomerName,ContactName,Country,OrderID,OrderDate
0,1,Alfreds Futterkiste,Maria Anders,Germany,NaN,NaT
1,2,Ana Trujillo Emparedados y helados,Ana Trujillo,Mexico,10308.0,1996-09-18
2,3,Antonio Moreno Taquería,Antonio Moreno,Mexico,NaN,NaT

#### right join (right outer join)

returns all the rows in the right table (i.e. orders) provide their matching values in the left table (i.e. customers)

In [59]:
customers.merge(orders, how='right', on='CustomerID')

,CustomerID,CustomerName,ContactName,Country,OrderID,OrderDate
0,2,Ana Trujillo Emparedados y helados,Ana Trujillo,Mexico,10308,1996-09-18
1,37,NaN,NaN,NaN,10309,1996-09-19
2,77,NaN,NaN,NaN,10310,1996-09-20

#### full outer join

full outer join though represented by the same venn diagram one compared with cross join is different from cross join. refer to this link for more details: https://stevestedman.com/2015/03/full-outer-join-vs-cross-join/

full outer join is like combining the the result of right join with left join and not repeating rows that are similar in both

In [65]:
customers.merge(orders, how='outer', on='CustomerID')

,CustomerID,CustomerName,ContactName,Country,OrderID,OrderDate
0,1,Alfreds Futterkiste,Maria Anders,Germany,NaN,NaT
1,2,Ana Trujillo Emparedados y helados,Ana Trujillo,Mexico,10308.0,1996-09-18
2,3,Antonio Moreno Taquería,Antonio Moreno,Mexico,NaN,NaT
3,37,NaN,NaN,NaN,10309.0,1996-09-19
4,77,NaN,NaN,NaN,10310.0,1996-09-20

### Joining Customers and Orders using Join

### pd.join()

#### inner join

In [64]:
customers.join(orders, how='inner',on='CustomerID', lsuffix='_x', rsuffix='_y')

,CustomerID,CustomerID_x,CustomerName,ContactName,Country,OrderID,CustomerID_y,OrderDate
0,1,1,Alfreds Futterkiste,Maria Anders,Germany,10309,37,1996-09-19
1,2,2,Ana Trujillo Emparedados y helados,Ana Trujillo,Mexico,10310,77,1996-09-20

#### lef join

In [67]:
customers.join(orders, how='left',on='CustomerID', lsuffix='_x', rsuffix='_y')

,CustomerID_x,CustomerName,ContactName,Country,OrderID,CustomerID_y,OrderDate
0,1,Alfreds Futterkiste,Maria Anders,Germany,10309.0,37.0,1996-09-19
1,2,Ana Trujillo Emparedados y helados,Ana Trujillo,Mexico,10310.0,77.0,1996-09-20
2,3,Antonio Moreno Taquería,Antonio Moreno,Mexico,NaN,NaN,NaT

#### right join

In [68]:
customers.join(orders, how='right',on='CustomerID', lsuffix='_x', rsuffix='_y')

,CustomerID,CustomerID_x,CustomerName,ContactName,Country,OrderID,CustomerID_y,OrderDate
NaN,0,NaN,NaN,NaN,NaN,10308,2,1996-09-18
0.0,1,1.0,Alfreds Futterkiste,Maria Anders,Germany,10309,37,1996-09-19
1.0,2,2.0,Ana Trujillo Emparedados y helados,Ana Trujillo,Mexico,10310,77,1996-09-20

#### outer join (full outer join)

In [69]:
customers.join(orders, how='outer',on='CustomerID', lsuffix='_x', rsuffix='_y')

,CustomerID,CustomerID_x,CustomerName,ContactName,Country,OrderID,CustomerID_y,OrderDate
0.0,1,1.0,Alfreds Futterkiste,Maria Anders,Germany,10309.0,37.0,1996-09-19
1.0,2,2.0,Ana Trujillo Emparedados y helados,Ana Trujillo,Mexico,10310.0,77.0,1996-09-20
2.0,3,3.0,Antonio Moreno Taquería,Antonio Moreno,Mexico,NaN,NaN,NaT
NaN,0,NaN,NaN,NaN,NaN,10308.0,2.0,1996-09-18

### So what is different between pd.merge and pd.join?

The conversation in this stakeoverflow link provides some insight:  https://stackoverflow.com/questions/22676081/what-is-the-difference-between-join-and-merge-in-pandas

#### Investigating how join works

NB. 
- merge return a new index for the table resulting from the merge while join maintain the original index of the two tables being joined  
- join method joins tables by default by index. Except indicated otherwise. 
- join return all the columns in both tables hence when the tables with similar column names are joined an error occurs. Except you define a suffix for the column names using the parameters - lsuffix, rsuffix as used above in the pd.join method

In [91]:
# created a order2 table with new index to see the effect index has on a join

orders2 = orders.copy()
orders2.index = [10,11,12]

In [92]:
orders

   OrderID  CustomerID  OrderDate
0    10308           2 1996-09-18
1    10309          37 1996-09-19
2    10310          77 1996-09-20

In [93]:
orders2

    OrderID  CustomerID  OrderDate
10    10308           2 1996-09-18
11    10309          37 1996-09-19
12    10310          77 1996-09-20

<strong>Ensuring that the ensuing that the table have use unique column names and joining by index</strong>

In [97]:
# tables are stacked by rows as the index do not match 
customers.join(orders.loc[:,['OrderID', 'OrderDate']], how='outer')

,CustomerID,CustomerName,ContactName,Country,OrderID,OrderDate
0,1,Alfreds Futterkiste,Maria Anders,Germany,10308,1996-09-18
1,2,Ana Trujillo Emparedados y helados,Ana Trujillo,Mexico,10309,1996-09-19
2,3,Antonio Moreno Taquería,Antonio Moreno,Mexico,10310,1996-09-20

In [ ]:
# tables columns are stacked by rows as  index  match

In [98]:
customers.join(orders2.loc[:,['OrderID', 'OrderDate']], how='outer')

,CustomerID,CustomerName,ContactName,Country,OrderID,OrderDate
0,1.0,Alfreds Futterkiste,Maria Anders,Germany,NaN,NaT
1,2.0,Ana Trujillo Emparedados y helados,Ana Trujillo,Mexico,NaN,NaT
2,3.0,Antonio Moreno Taquería,Antonio Moreno,Mexico,NaN,NaT
10,NaN,NaN,NaN,NaN,10308.0,1996-09-18
11,NaN,NaN,NaN,NaN,10309.0,1996-09-19
12,NaN,NaN,NaN,NaN,10310.0,1996-09-20

<strong>Error Expected:</strong>  

Resulting from joining two tables with join that have columns with the same column name

In [99]:
# attempting to join two table that have the same column names would result in an error 

customers.join(orders, how='outer')

ValueError: columns overlap but no suffix specified: Index(['CustomerID'], dtype='object')